Revit 2027 API
BuiltInFailures.StairRampFailures.RailProfileOpen Property
 Open Profile Loop can't be used as a Rail Profile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailProfileOpen { get; }
Public Shared ReadOnly Property RailProfileOpen As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailProfileOpen {
	FailureDefinitionId^ get ();
}
static member RailProfileOpen : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace